#+title: Comprehensive Parameter Impact Evaluation Across All Simulation Datasets
#+PROPERTY: header-args:R :exports both :results value :colnames yes :dir ../ :cache yes :eval nevel-export
#+LATEX_CLASS_OPTIONS: [9pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{longtable}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{amssymb, amsmath}
#+author: Kaidong
#+date: 2025

* Abstract

This document presents a comprehensive evaluation of parameter influence across all available simulation datasets. We systematically apply the variance decomposition method to analyze the impact of 10 different parameters (indices 2-11) on four key trajectory measurements: agent time enabled, collision times, distance traveled, and PLE energy consumption. The analysis covers both heterogeneous and homogeneous simulation conditions, providing a complete landscape of parameter effects across the experimental space.

* Introduction

Building upon the theoretical framework established in =theory.org= and validated through controlled experiments in =verification.org=, this comprehensive evaluation applies the variance decomposition method to the complete dataset collection. Each parameter-measurement combination is assessed using the bootstrap impact test, yielding quantitative estimates of parameter influence magnitude, statistical significance, and effect size.

** Evaluation Structure

The evaluation is organized into eight primary tables:

1. **Heterogeneous Simulations - Agent Time Enabled**: Parameter effects on agent active time
2. **Heterogeneous Simulations - Collision Times**: Parameter effects on collision frequency  
3. **Heterogeneous Simulations - Distance Traveled**: Parameter effects on movement extent
4. **Heterogeneous Simulations - PLE Energy**: Parameter effects on energy consumption

5. **Homogeneous Simulations - Agent Time Enabled**: Same metrics under homogeneous conditions
6. **Homogeneous Simulations - Collision Times**
7. **Homogeneous Simulations - Distance Traveled**
8. **Homogeneous Simulations - PLE Energy**

Each table contains parameter indices 2-11 as rows and the following evaluation metrics as columns:

- **Impact**: Impact variance (Var(Y.random) - Var(Y.same))
- **Var.Same**: Same-parameter variance (noise baseline)
- **Var.Rand**: Random-parameter variance (noise + signal)
- **Effect.Size**: Normalized effect size (Impact / Var.Same)
- **P.Value**: Bootstrap p-value for H0: Impact ≤ 0
- **CI.Lower**: Lower bound of 95% confidence interval
- **CI.Upper**: Upper bound of 95% confidence interval

** Computational Parameters

All analyses use the following parameters:
- Bootstrap iterations: B = 1000
- Confidence level: 95%
- Alternative hypothesis: "greater" (Impact > 0)

* Heterogeneous Simulations

** Agent Time Enabled

#+name: hetero_time_enabled
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for heterogeneous simulations - agent time enabled
results <- analyze_all_parameters_cached(
  sim_type = "heterogeneous",
  measure_column = "baseLog.agent_time_enableds",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[c336241d25116460d2eb73ee71f58e66108cf079]: hetero_time_enabled
| Parameter |  Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+---------+-------------+---------+----------+----------------|
|         2 | 13.1213 |      0.0825 |       0 |  11.8946 | YES:--         |
|         3 |  0.2228 |      0.0014 |    0.37 |  -0.9356 | ---:NO         |
|         4 | 33.1919 |      0.2346 |       0 |  32.0015 | YES:--         |
|         5 |  0.3346 |      0.0021 |   0.293 |  -0.7889 | ---:NO         |
|         6 |  0.0925 |      0.0006 |   0.448 |  -0.9441 | ---:NO         |
|         7 | -1.8229 |     -0.0106 |   0.867 |  -4.4513 | ---:NO         |
|         8 | 59.1013 |      0.4898 |       0 |   58.012 | YES:--         |
|         9 | -0.5966 |     -0.0038 |   0.802 |   -1.689 | ---:NO         |
|        10 | -0.3052 |      -0.002 |   0.643 |  -1.3813 | ---:NO         |
|        11 | -0.0374 |     -0.0003 |    0.54 |  -1.1439 | ---:NO         |

** Collision Times

#+name: hetero_collision_times
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for heterogeneous simulations - collision times
results <- analyze_all_parameters_cached(
  sim_type = "heterogeneous",
  measure_column = "baseLog.collisionTimes",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[415715dba11fc62d7f88adf98762b8dc227cc292]: hetero_collision_times
| Parameter |   Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+----------+-------------+---------+----------+----------------|
|         2 | 206.8098 |      0.1814 |       0 | 197.1135 | YES:--         |
|         3 |  -0.5416 |     -0.0004 |   0.513 |  -9.9292 | ---:NO         |
|         4 | 225.9138 |      0.2015 |       0 | 216.4623 | YES:--         |
|         5 |  17.8711 |      0.0145 |   0.001 |   8.8738 | YES:--         |
|         6 |  -1.6304 |     -0.0014 |   0.623 | -10.6143 | ---:NO         |
|         7 |   1.1538 |      0.0009 |   0.405 |  -7.5765 | ---:NO         |
|         8 | 262.9706 |      0.2995 |       0 |   254.76 | YES:--         |
|         9 |  -6.1008 |      -0.005 |   0.865 | -15.3617 | ---:NO         |
|        10 |   2.9979 |      0.0025 |   0.293 |  -5.8323 | ---:NO         |
|        11 |  -7.3141 |     -0.0062 |   0.919 | -15.6789 | ---:NO         |

** Distance Traveled

#+name: hetero_distance_traveled
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for heterogeneous simulations - distance traveled
results <- analyze_all_parameters_cached(
  sim_type = "heterogeneous",
  measure_column = "baseLog.agent_distance_traveleds",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[b428e3e1162453987a8847a2b4ff14f3273c7ffd]: hetero_distance_traveled
| Parameter |  Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+---------+-------------+---------+----------+----------------|
|         2 |  3.0392 |       0.081 |       0 |   2.7379 | YES:--         |
|         3 |  0.0142 |      0.0004 |    0.46 |  -0.2522 | ---:NO         |
|         4 |  1.6671 |      0.0555 |       0 |    1.413 | YES:--         |
|         5 |  0.7448 |      0.0203 |       0 |   0.4742 | YES:--         |
|         6 |  0.0078 |      0.0002 |   0.448 |  -0.2585 | ---:NO         |
|         7 |  -0.768 |      -0.017 |   0.846 |  -2.1424 | ---:NO         |
|         8 |  4.4454 |      0.1874 |       0 |   4.2447 | YES:--         |
|         9 | -0.0938 |     -0.0026 |   0.693 |  -0.3463 | ---:NO         |
|        10 | -0.0004 |           0 |   0.485 |  -0.2711 | ---:NO         |
|        11 |  0.1127 |      0.0033 |    0.23 |  -0.1463 | ---:NO         |

** PLE Energy

#+name: hetero_ple_energy
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for heterogeneous simulations - PLE energy
results <- analyze_all_parameters_cached(
  sim_type = "heterogeneous",
  measure_column = "baseLog.agent_ple_energys",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[91ceaa8c13e386192a23ee7d356dc461785cb92e]: hetero_ple_energy
| Parameter |   Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+----------+-------------+---------+----------+----------------|
|         2 |  88.8163 |      0.0851 |       0 |  81.2565 | YES:--         |
|         3 |   1.0141 |       0.001 |   0.433 |  -6.5417 | ---:NO         |
|         4 | 109.4964 |      0.1216 |       0 | 102.3503 | YES:--         |
|         5 |   6.2166 |       0.006 |   0.091 |  -1.2029 | ---:NO         |
|         6 |   0.1202 |      0.0001 |   0.517 |  -7.3416 | ---:NO         |
|         7 | -13.7179 |     -0.0118 |   0.854 | -35.4071 | ---:NO         |
|         8 | 243.6197 |      0.3275 |       0 | 236.4651 | YES:--         |
|         9 |  -3.7515 |     -0.0037 |   0.777 | -11.3265 | ---:NO         |
|        10 |    -1.39 |     -0.0014 |   0.616 |  -8.2859 | ---:NO         |
|        11 |   0.6773 |      0.0007 |    0.43 |  -6.4343 | ---:NO         |

* Homogeneous Simulations

** Agent Time Enabled

#+name: homo_time_enabled
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for homogeneous simulations - agent time enabled
results <- analyze_all_parameters_cached(
  sim_type = "homogeneous",
  measure_column = "baseLog.agent_time_enableds",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[2a34d5c6fea5ec5be78118e28e70ee6e14834f06]: homo_time_enabled
| Parameter |  Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+---------+-------------+---------+----------+----------------|
|         2 | 11.3314 |      0.0567 |       0 |   9.7249 | YES:--         |
|         3 | -0.1727 |     -0.0011 |   0.606 |   -1.239 | ---:NO         |
|         4 | 21.9335 |      0.1421 |       0 |  20.7165 | YES:--         |
|         5 |  0.6564 |       0.004 |   0.166 |  -0.4662 | ---:NO         |
|         6 |  0.4142 |      0.0027 |   0.286 |  -0.7224 | ---:NO         |
|         7 |   4.471 |      0.0266 |   0.001 |   2.0335 | YES:--         |
|         8 | 38.9892 |      0.2684 |       0 |  37.7099 | YES:--         |
|         9 |  0.3982 |      0.0026 |   0.298 |  -0.7984 | ---:NO         |
|        10 |  0.6749 |      0.0045 |   0.142 |  -0.4362 | ---:NO         |
|        11 |  0.5932 |      0.0039 |    0.19 |  -0.5493 | ---:NO         |

** Collision Times

#+name: homo_collision_times
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for homogeneous simulations - collision times
results <- analyze_all_parameters_cached(
  sim_type = "homogeneous",
  measure_column = "baseLog.collisionTimes",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[9fae38a826f9ef6a6f89f075590b5573805696ea]: homo_collision_times
| Parameter |   Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+----------+-------------+---------+----------+----------------|
|         2 | 306.3212 |      0.2053 |       0 | 292.4531 | YES:--         |
|         3 |   0.4188 |      0.0003 |   0.471 |  -7.9006 | ---:NO         |
|         4 | 113.5726 |      0.0942 |       0 | 103.9548 | YES:--         |
|         5 |  39.9143 |      0.0329 |       0 |  30.8581 | YES:--         |
|         6 |   1.4468 |      0.0012 |   0.387 |  -7.4177 | ---:NO         |
|         7 |  -4.4455 |     -0.0036 |   0.799 | -13.8373 | ---:NO         |
|         8 |  53.8727 |      0.0486 |       0 |  45.0897 | YES:--         |
|         9 |   4.0827 |      0.0034 |   0.216 |   -5.014 | ---:NO         |
|        10 |  -3.3001 |     -0.0028 |   0.702 | -11.6815 | ---:NO         |
|        11 |   0.6156 |      0.0005 |   0.444 |  -8.7326 | ---:NO         |

** Distance Traveled

#+name: homo_distance_traveled
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for homogeneous simulations - distance traveled
results <- analyze_all_parameters_cached(
  sim_type = "homogeneous",
  measure_column = "baseLog.agent_distance_traveleds",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[e1cceb05e85d55fb367bd45a5ca7995348c4a87e]: homo_distance_traveled
| Parameter |  Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+---------+-------------+---------+----------+----------------|
|         2 |   2.075 |      0.0431 |       0 |   1.6721 | YES:--         |
|         3 |  -0.118 |     -0.0033 |    0.77 |  -0.3685 | ---:NO         |
|         4 | -1.4368 |     -0.0411 |       1 |  -1.6842 | ---:NO         |
|         5 |  0.9213 |      0.0249 |       0 |   0.6419 | YES:--         |
|         6 |  0.1761 |      0.0049 |   0.139 |   -0.105 | ---:NO         |
|         7 |   2.821 |      0.0663 |       0 |   1.6243 | YES:--         |
|         8 | -0.9548 |     -0.0307 |       1 |  -1.1904 | ---:NO         |
|         9 |    0.05 |      0.0014 |   0.418 |    -0.23 | ---:NO         |
|        10 |  0.2126 |      0.0061 |   0.113 |  -0.0667 | ---:NO         |
|        11 |  0.0732 |      0.0021 |   0.324 |   -0.195 | ---:NO         |

** PLE Energy

#+name: homo_ple_energy
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze all parameters for homogeneous simulations - PLE energy
results <- analyze_all_parameters_cached(
  sim_type = "homogeneous",
  measure_column = "baseLog.agent_ple_energys",
  data_dir = "data",
  B = 1000,
  conf.level = 0.95,
  cache_dir = ".localfiles"
)

results %>%
  select(Parameter, Impact, Effect_Size, P_Value, CI_Lower) %>%
  rename(Effect.Size = Effect_Size, P.Value = P_Value, CI.Lower = CI_Lower) %>%
  round(digit=4) %>%
  mutate(Is.Significant = if_else(P.Value < 0.05, "YES:--", "---:NO")) %>%
  rename(Is.Significant = Is.Significant)
#+end_src

#+RESULTS[75e593f3aebbb1a52a95a1a06b25595ca0f3a28b]: homo_ple_energy
| Parameter |  Impact | Effect.Size | P.Value | CI.Lower | Is.Significant |
|-----------+---------+-------------+---------+----------+----------------|
|         2 | 84.8302 |      0.0642 |       0 |  73.6237 | YES:--         |
|         3 | -1.4808 |     -0.0015 |   0.643 |  -8.5742 | ---:NO         |
|         4 | 28.6417 |      0.0287 |       0 |  21.5077 | YES:--         |
|         5 |  8.7217 |      0.0082 |   0.033 |   0.8806 | YES:--         |
|         6 |  3.9815 |       0.004 |     0.2 |  -3.6269 | ---:NO         |
|         7 | 39.9121 |      0.0356 |       0 |  19.8758 | YES:--         |
|         8 | 91.9377 |      0.0992 |       0 |  84.3685 | YES:--         |
|         9 |   2.455 |      0.0024 |   0.288 |  -5.1314 | ---:NO         |
|        10 |  4.5165 |      0.0046 |   0.128 |  -2.1925 | ---:NO         |
|        11 |  3.4594 |      0.0035 |   0.179 |   -3.131 | ---:NO         |

* Overall Significance Summary

This section provides a quick overview of parameter significance across all simulation conditions and measurements.

#+name: significance_summary
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Run all 8 analyses in parallel
sim_types <- c("heterogeneous", "homogeneous")
measures <- c(
  "baseLog.agent_time_enableds",
  "baseLog.collisionTimes",
  "baseLog.agent_distance_traveleds",
  "baseLog.agent_ple_energys"
)

measure_labels <- c(
  "Time.Enabled",
  "Collision.Times",
  "Distance.Traveled",
  "PLE.Energy"
)

# Create all combinations
combinations <- expand.grid(
  sim_type = sim_types,
  measure_idx = seq_along(measures),
  stringsAsFactors = FALSE
)

# Parallel processing function
process_combination <- function(i) {
  sim_type <- combinations$sim_type[i]
  measure_idx <- combinations$measure_idx[i]
  measure <- measures[measure_idx]
  label <- measure_labels[measure_idx]
  
  results <- analyze_all_parameters_cached(
    sim_type = sim_type,
    measure_column = measure,
    data_dir = "data",
    B = 1000,
    conf.level = 0.95,
    cache_dir = ".localfiles"
  )
  
  # Create column name combining sim_type and measurement
  col_name <- paste0(substring(sim_type, 1, 4), ".", label)
  
  # Extract only Parameter and Is.Significant
  results_subset <- results %>%
    select(Parameter, P_Value) %>%
    mutate(!!col_name := if_else(P_Value < 0.05, "YES", "NO")) %>%
    select(Parameter, !!col_name)
  
  return(results_subset)
}

# Run in parallel
n_cores <- max(1, parallel::detectCores() - 1)
all_results <- parallel::mclapply(
  seq_len(nrow(combinations)),
  process_combination,
  mc.cores = n_cores
)

# Merge all results by Parameter
significance_table <- all_results[[1]]
for (i in 2:length(all_results)) {
  significance_table <- merge(significance_table, all_results[[i]], by = "Parameter", all = TRUE)
}

# Transpose: make parameters as columns and categories as rows
significance_table_transposed <- significance_table %>%
  arrange(Parameter) %>%
  pivot_longer(cols = -Parameter, names_to = "Category", values_to = "Significant") %>%
  pivot_wider(names_from = Parameter, values_from = Significant, names_prefix = "P.")

# Reorder categories logically (heterogeneous first, then homogeneous)
category_order <- c(
  "hete.Time.Enabled", "hete.Collision.Times", "hete.Distance.Traveled", "hete.PLE.Energy",
  "homo.Time.Enabled", "homo.Collision.Times", "homo.Distance.Traveled", "homo.PLE.Energy"
)

significance_table_transposed <- significance_table_transposed %>%
  mutate(Category = factor(Category, levels = category_order)) %>%
  arrange(Category) %>%
  mutate(Category = as.character(Category))

significance_table_transposed
#+end_src

#+RESULTS[0900ed25c51a6c7408d826e0100e5389519277ff]: significance_summary
| Category               | P.2 | P.3 | P.4 | P.5 | P.6 | P.7 | P.8 | P.9 | P.10 | P.11 |
|------------------------+-----+-----+-----+-----+-----+-----+-----+-----+------+------|
| hete.Time.Enabled      | YES | NO  | YES | NO  | NO  | NO  | YES | NO  | NO   | NO   |
| hete.Collision.Times   | YES | NO  | YES | YES | NO  | NO  | YES | NO  | NO   | NO   |
| hete.Distance.Traveled | YES | NO  | YES | YES | NO  | NO  | YES | NO  | NO   | NO   |
| hete.PLE.Energy        | YES | NO  | YES | NO  | NO  | NO  | YES | NO  | NO   | NO   |
| homo.Time.Enabled      | YES | NO  | YES | NO  | NO  | YES | YES | NO  | NO   | NO   |
| homo.Collision.Times   | YES | NO  | YES | YES | NO  | NO  | YES | NO  | NO   | NO   |
| homo.Distance.Traveled | YES | NO  | NO  | YES | NO  | YES | NO  | NO  | NO   | NO   |
| homo.PLE.Energy        | YES | NO  | YES | YES | NO  | YES | YES | NO  | NO   | NO   |

* Comparative Analysis

** Summary Statistics Across All Conditions

#+name: summary_statistics
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Combine all results for comparative analysis using parallel processing
sim_types <- c("heterogeneous", "homogeneous")
measures <- c(
  "baseLog.agent_time_enableds",
  "baseLog.collisionTimes",
  "baseLog.agent_distance_traveleds",
  "baseLog.agent_ple_energys"
)

measure_labels <- c(
  "Time.Enabled",
  "Collision.Times",
  "Distance.Traveled",
  "PLE.Energy"
)

# Create all combinations of sim_type and measure
combinations <- expand.grid(
  sim_type = sim_types,
  measure_idx = seq_along(measures),
  stringsAsFactors = FALSE
)

# Parallel processing function
process_combination <- function(i) {
  sim_type <- combinations$sim_type[i]
  measure_idx <- combinations$measure_idx[i]
  measure <- measures[measure_idx]
  label <- measure_labels[measure_idx]
  
  results <- analyze_all_parameters_cached(
    sim_type = sim_type,
    measure_column = measure,
    data_dir = "data",
    B = 100,  # Reduced for summary computation
    conf.level = 0.95,
    cache_dir = ".localfiles"
  )
  
  results$Sim_Type <- sim_type
  results$Measurement <- label
  
  return(results)
}

# Run in parallel
n_cores <- max(1, parallel::detectCores() - 1)
all_results <- parallel::mclapply(
  seq_len(nrow(combinations)),
  process_combination,
  mc.cores = n_cores
)

# Combine all results
combined_df <- do.call(rbind, all_results)

# Calculate summary statistics
summary_df <- combined_df %>%
  group_by(Sim_Type, Measurement) %>%
  summarise(
    N.Sgnf = sum(P_Value < 0.05, na.rm = TRUE),
    Mean.Impact = mean(Impact, na.rm = TRUE),
    Mean.Effect.Size = mean(Effect_Size, na.rm = TRUE),
    Max.Effect.Size = max(Effect_Size, na.rm = TRUE),
    .groups = "drop"
  ) %>%
  arrange(desc(Mean.Effect.Size)) %>%
  mutate(across(where(is.numeric), ~round(., digits=4))) %>%
  rename(Sim.Type = Sim_Type)

summary_df
#+end_src

#+RESULTS[71aeb370de8e09275338abbedec32c0cb9b8ce71]: summary_statistics
| Sim.Type      | Measurement       | N.Sgnf | Mean.Impact | Mean.Effect.Size | Max.Effect.Size |
|---------------+-------------------+--------+-------------+------------------+-----------------|
| heterogeneous | Time.Enabled      |      3 |     10.3302 |           0.0794 |          0.4898 |
| heterogeneous | Collision.Times   |      4 |      70.213 |           0.0688 |          0.2995 |
| heterogeneous | PLE.Energy        |      3 |     43.1101 |           0.0525 |          0.3275 |
| homogeneous   | Time.Enabled      |      4 |      7.9289 |            0.051 |          0.2684 |
| homogeneous   | Collision.Times   |      4 |     51.2499 |            0.038 |          0.2053 |
| heterogeneous | Distance.Traveled |      4 |      0.9169 |           0.0329 |          0.1874 |
| homogeneous   | PLE.Energy        |      5 |     26.6975 |           0.0249 |          0.0992 |
| homogeneous   | Distance.Traveled |      3 |       0.382 |           0.0074 |          0.0663 |

** Parameter Ranking by Average Effect

#+name: parameter_ranking
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Rank parameters by their average impact across all measurements and simulation types
# Using parallel processing
sim_types <- c("heterogeneous", "homogeneous")
measures <- c(
  "baseLog.agent_time_enableds",
  "baseLog.collisionTimes",
  "baseLog.agent_distance_traveleds",
  "baseLog.agent_ple_energys"
)

# Create all combinations
combinations <- expand.grid(
  sim_type = sim_types,
  measure_idx = seq_along(measures),
  stringsAsFactors = FALSE
)

# Parallel processing function
process_combination <- function(i) {
  sim_type <- combinations$sim_type[i]
  measure_idx <- combinations$measure_idx[i]
  measure <- measures[measure_idx]
  
  results <- analyze_all_parameters_cached(
    sim_type = sim_type,
    measure_column = measure,
    data_dir = "data",
    B = 100,  # Reduced for ranking computation
    conf.level = 0.95,
    cache_dir = ".localfiles"
  )
  
  results$Sim_Type <- sim_type
  results$Measurement <- measure
  
  return(results)
}

# Run in parallel
n_cores <- max(1, parallel::detectCores() - 1)
all_results <- parallel::mclapply(
  seq_len(nrow(combinations)),
  process_combination,
  mc.cores = n_cores
)

# Combine all results
combined_df <- do.call(rbind, all_results)

# Calculate average metrics per parameter across sim types
parameter_ranking <- combined_df %>%
  group_by(Parameter, Sim_Type) %>%
  summarise(
    N.Sgnf = sum(P_Value < 0.05, na.rm = TRUE),
    Avg.Impact = mean(Impact, na.rm = TRUE),
    Avg.Effect.Size = mean(Effect_Size, na.rm = TRUE),
    Max.Effect.Size = max(Effect_Size, na.rm = TRUE),
    .groups = "drop"
  ) %>%
  arrange(desc(Avg.Effect.Size)) %>%
  mutate(across(where(is.numeric), ~round(., digits=4))) %>%
  rename(Sim.Type = Sim_Type)

parameter_ranking
#+end_src

#+RESULTS[8f1bdf9a04ad361d6ccccd3175a1c9a1e920ab1f]: parameter_ranking
| Parameter | Sim.Type      | N.Sgnf | Avg.Impact | Avg.Effect.Size | Max.Effect.Size |
|-----------+---------------+--------+------------+-----------------+-----------------|
|         8 | heterogeneous |      4 |   142.5343 |          0.3261 |          0.4898 |
|         4 | heterogeneous |      4 |    92.5673 |          0.1533 |          0.2346 |
|         2 | heterogeneous |      4 |    77.9467 |          0.1075 |          0.1814 |
|         8 | homogeneous   |      3 |    45.9612 |          0.0964 |          0.2684 |
|         2 | homogeneous   |      4 |   101.1394 |          0.0923 |          0.2053 |
|         4 | homogeneous   |      3 |    40.6777 |           0.056 |          0.1421 |
|         7 | homogeneous   |      3 |    10.6897 |          0.0312 |          0.0663 |
|         5 | homogeneous   |      3 |    12.5534 |          0.0175 |          0.0329 |
|         5 | heterogeneous |      2 |     6.2918 |          0.0107 |          0.0203 |
|         6 | homogeneous   |      0 |     1.5046 |          0.0032 |          0.0049 |
|        10 | homogeneous   |      0 |      0.526 |          0.0031 |          0.0061 |
|        11 | homogeneous   |      0 |     1.1853 |          0.0025 |          0.0039 |
|         9 | homogeneous   |      0 |     1.7465 |          0.0024 |          0.0034 |
|         3 | heterogeneous |      0 |     0.1774 |          0.0006 |          0.0014 |
|         6 | heterogeneous |      0 |    -0.3525 |         -0.0001 |          0.0006 |
|        10 | heterogeneous |      0 |     0.3256 |         -0.0002 |          0.0025 |
|        11 | heterogeneous |      0 |    -1.6404 |         -0.0006 |          0.0033 |
|         3 | homogeneous   |      0 |    -0.3382 |         -0.0014 |          0.0003 |
|         9 | heterogeneous |      0 |    -2.6357 |         -0.0038 |         -0.0026 |
|         7 | heterogeneous |      0 |    -3.7888 |         -0.0096 |          0.0009 |

** Measurement Sensitivity Analysis

#+name: measurement_sensitivity
#+begin_src R
source("examples/comprehensive_analysis_setup.R")

# Analyze which measurements are most sensitive to parameter variations
# Using parallel processing
sim_types <- c("heterogeneous", "homogeneous")
measures <- c(
  "baseLog.agent_time_enableds",
  "baseLog.collisionTimes",
  "baseLog.agent_distance_traveleds",
  "baseLog.agent_ple_energys"
)

measure_labels <- c(
  "Time.Enabled",
  "Collision.Times",
  "Distance.Traveled",
  "PLE.Energy"
)

# Create all combinations
combinations <- expand.grid(
  sim_type = sim_types,
  measure_idx = seq_along(measures),
  stringsAsFactors = FALSE
)

# Parallel processing function
process_combination <- function(i) {
  sim_type <- combinations$sim_type[i]
  measure_idx <- combinations$measure_idx[i]
  measure <- measures[measure_idx]
  label <- measure_labels[measure_idx]
  
  results <- analyze_all_parameters_cached(
    sim_type = sim_type,
    measure_column = measure,
    data_dir = "data",
    B = 100,  # Reduced for sensitivity analysis
    conf.level = 0.95,
    cache_dir = ".localfiles"
  )
  
  results$Sim_Type <- sim_type
  results$Measurement <- label
  
  return(results)
}

# Run in parallel
n_cores <- max(1, parallel::detectCores() - 1)
all_results <- parallel::mclapply(
  seq_len(nrow(combinations)),
  process_combination,
  mc.cores = n_cores
)

# Combine all results
combined_df <- do.call(rbind, all_results)

# Calculate sensitivity metrics per measurement type
sensitivity_df <- combined_df %>%
  group_by(Measurement, Sim_Type) %>%
  summarise(
    Avg.Effect.Size = mean(Effect_Size, na.rm = TRUE),
    SD.Effect.Size = sd(Effect_Size, na.rm = TRUE),
    Max.Effect.Size = max(Effect_Size, na.rm = TRUE),
    N.Sgnf = sum(P_Value < 0.05, na.rm = TRUE),
    .groups = "drop"
  ) %>%
  arrange(desc(Avg.Effect.Size)) %>%
  mutate(across(where(is.numeric), ~round(., digits=4))) %>%
  rename(Sim.Type = Sim_Type)

sensitivity_df
#+end_src

#+RESULTS[5d99beed11737aed77cb032512317f7a36584954]: measurement_sensitivity
| Measurement       | Sim.Type      | Avg.Effect.Size | SD.Effect.Size | Max.Effect.Size | N.Sgnf |
|-------------------+---------------+-----------------+----------------+-----------------+--------|
| Time.Enabled      | heterogeneous |          0.0794 |         0.1629 |          0.4898 |      3 |
| Collision.Times   | heterogeneous |          0.0688 |         0.1137 |          0.2995 |      4 |
| PLE.Energy        | heterogeneous |          0.0525 |         0.1064 |          0.3275 |      3 |
| Time.Enabled      | homogeneous   |           0.051 |         0.0883 |          0.2684 |      4 |
| Collision.Times   | homogeneous   |           0.038 |         0.0667 |          0.2053 |      4 |
| Distance.Traveled | heterogeneous |          0.0329 |         0.0621 |          0.1874 |      4 |
| PLE.Energy        | homogeneous   |          0.0249 |         0.0333 |          0.0992 |      5 |
| Distance.Traveled | homogeneous   |          0.0074 |         0.0317 |          0.0663 |      3 |

* Interpretation Guidelines

** Effect Size Interpretation

Based on the theoretical framework:

- **Effect Size < 0.1**: Negligible parameter influence (< 10% of noise baseline)
- **Effect Size 0.1-1.0**: Moderate parameter influence
- **Effect Size > 1.0**: Strong parameter influence (exceeds noise baseline)

** Statistical Significance

- **P-value < 0.05**: Statistically significant evidence of parameter influence
- **P-value ≥ 0.05**: No statistically significant evidence (but may still have practical importance)

** Confidence Interval Interpretation

- **CI.Lower > 0**: Strong evidence of positive parameter influence
- **CI.Lower ≤ 0, CI.Upper > 0**: Uncertain effect, may need larger sample size
- **CI.Upper ≤ 0**: Evidence against parameter influence

* Conclusions

This comprehensive evaluation provides a complete quantitative assessment of parameter influence across:
- 10 parameters (indices 2-11)
- 2 simulation types (heterogeneous and homogeneous)
- 4 measurement categories (time, collisions, distance, energy)
- Total: 80 parameter-measurement combinations

The results enable:
1. Identification of the most influential parameters for model calibration
2. Understanding of measurement sensitivity to parameter variations
3. Comparison of parameter effects between heterogeneous and homogeneous conditions
4. Prioritization of parameters for further investigation or control

** Future Directions

1. **Multivariate Analysis**: Examine interactions between multiple parameters simultaneously
2. **Temporal Analysis**: Investigate parameter influence over simulation time
3. **Sensitivity to Sample Size**: Determine minimum data requirements for reliable detection
4. **Heteroscedasticity Analysis**: Test assumption of constant conditional variance

# Local Variables:
# org-babel-R-command: "nix run . -- --slave --no-save"
# eval: (setq-local org-format-latex-options (plist-put org-format-latex-options :scale 1.2))
# eval: (setq-local org-babel-default-header-args:R '((:exports . "both")))
# END:
